Dougal121/Essence_of_Thor/ESP32Now/ESP32_I2ClIrrigationValve_Core3.ino
/*
    This project is a distillation of "Project Thor"  ( which started in 2008 )
    So in that vein you can expect it's lost a little corporeal body but the conceptual "active constituents" are present in a concerntrated form.

    The code is designed to work with/in multiple configurations and hardware based around the ESP32.

    It was fabricated at code works of Plummer Software in Coomealla, Australia circa 2019
    Newer copies can be found at https://github.com/Dougal121/Essence_of_Thor
    May contain traces of code by ChatGPT, thankyou "AIden"

    The idea is to provide low cost high tech fertigation/irrigation control for real world farming which is scalable from small to medium size farms (0.1 to 100 Ha)

 XXX   Mesh Radio using ESP32 implemented Cira June 2026 (replacing the LoRa radio)
 XXX   1.9MB APP with OTA/190KB SPIFFS  - this is a custom setting you need to place this in the boards area of Arduino
 XXX   See https://www.hackster.io/dougal/beyond-essence-of-irrigation-part-2-lora-flavor-743704  for more details

   Compiles for LOLIN D32 @ 80Mhz
   Minimal SPIFFS (Large APPS with OTA)
   
   Builds with 3.3.8  ESP32 Core
       Having trouble downloading on some boards in IDE 2.13 ?  so use ol 1.8.12 for first download then use OTA ?
*/
#define BUILD_TIME (__DATE__ " " __TIME__)
#define SECS_PER_DAY  60*60*24
#define SECS_PER_HOUR 60*60
typedef struct  {
  uint8_t Second;  // 0-59
  uint8_t Minute;  // 0-59
  uint8_t Hour;    // 0-23
  uint8_t Wday;    // 1-7, Sunday is day 1
  uint8_t Day;     // 1-31
  uint8_t Month;   // 1-12
  uint8_t Year;    // offset from 1970 (not 1900 like struct tm)
} tmElements_t;


#define SECS_PER_DAY 86400  // 60 * 60 * 24
#define SECS_PER_HOUR 3600  // 60*60
#define SECS_PER_WEEK  604800 // 60*60*24*7
/*
typedef struct  {
  uint8_t Second;  // 0-59
  uint8_t Minute;  // 0-59
  uint8_t Hour;    // 0-23
  uint8_t Wday;    // 1-7, Sunday is day 1
  uint8_t Day;     // 1-31
  uint8_t Month;   // 1-12
  uint8_t Year;    // offset from 1970 (not 1900 like struct tm)
} tmElements_t;
*/

#include <WiFi.h>              // All creature great and small as long as they are WiFi based 
#include <WiFiClient.h>        // from the "standard book of spells" (Arduino lib manager)
#include <WebServer.h>         // what it says on the box
//#include <ESPmDNS.h>           // One we used earlier but didnt get back to
#include <WiFiUDP.h>           // UDP protocol driver
#include <Update.h>            // this is the OTA update code ?
//#include <TimeLib.h>           // All the handy time functions in UNIX based time



#include "esp_idf_version.h"

#ifndef ESP_ARDUINO_VERSION_VAL
#define ESP_ARDUINO_VERSION_VAL(major, minor, patch) ((major << 16) | (minor << 8) | (patch))
#endif

#ifndef ESP_ARDUINO_VERSION
#define ESP_ARDUINO_VERSION ESP_ARDUINO_VERSION_VAL(3,3,3)  // fallback to 3.3.3 or whatever
#endif

// ---- Arduino core detection ----
#if ESP_ARDUINO_VERSION < ESP_ARDUINO_VERSION_VAL(2,0,0)
    #define CORE_ESP32_1X
#elif ESP_ARDUINO_VERSION < ESP_ARDUINO_VERSION_VAL(3,0,0)
    #define CORE_ESP32_2X
#else
    #define CORE_ESP32_3X
#endif

#if defined(ESP32) && !defined(ESP_ARDUINO_VERSION) /* ESP32 core < v2.0.x */
#include <sys/time.h>
#else
//#include <time.h>
#endif
#include <time.h>
#include <FastLED.h>
#include "EspNowMesh.h"
#include "MeshPacket.h"
#include "RFManager.h"
#include "ModbusBackend.h"
#include "HC595_16.h"

#include <Wire.h>              // I2C bus driver and SPI driver
#include <EEPROM.h>            // Internal chip eeprom
#include <stdio.h>             // The odd angree shot in pure C
#include "PCF8574DJP.h"        // Bastardised version of an orginal lib 
#include "Adafruit_MCP23017.h" // Port expansion lib ... modified ?
#include "SSD1306.h"           // OLED Display
//#include "SH1106.h"          // OLED Display
#include "SH1106Wire.h"        // Another breed of OLED
#include "ds3231.h"            // RTC   --- this one is in my solar tracker projects libs (in GIT )
#include <ESP_Mail_Client.h>   // Include ESP Mail Client library (this library)
//#include <LoRa.h>              // From the TTGO sites Git Repositry (loaded via arduino IDE lib manager)
//#include <esp_task_wdt.h>
//#include <esp32-hal-watchdog.h>

#include <esp_now.h>
#include <esp_wifi.h>
#include "esp_system.h"

//define the pins used by the LoRa transceiver module
/*
#define SCK 5
#define MISO 19
#define MOSI 27
#define SS 18
#define RST 14
#define DIO0 26
*/

#define OLED_SDA 4
#define OLED_SCL 15 
#define OLED_RST 16


//433E6 for Asia
//866E6 for Europe
//915E6 for North America / Australia
//#define BAND 915E6

#include "uEEPROMLib.h"                       //   SD card lib for the RTC memory logging
//#include <ESP8266Ping.h>
uEEPROMLib rtceeprom(0x57);

#define RS485_RX 16
#define RS485_TX 17
#define RS485_DE 26

HardwareSerial SerialRS485(2);  // ESP32 pins 16 and 17 for serial poert

#ifndef PIN_DATA
#define PIN_DATA 2
#endif  // PIN_DATA
#define NUM_LEDS 1 
CRGB leds[NUM_LEDS];

#define ESP32_BUILTIN_LED 2
#define BUFF_MAX 32
/* Display settings */

#define MIN_REBOOT  720             //   720   12 hours normally      10 min for testing

#define minRow       0              /* default =   0 */
#define maxRow     127              /* default = 127 */
#define minLine      0              /* default =   0 */
#define maxLine     63              /* default =  63 */

#define LineText     0
#define Line        12

#define MAX_LOCAL_IO 16    // same a sa relay board

#if defined(ESP32)
#define MaxPinPort  40
#define MinPinPort   0
#define ADC_MAX_CHAN  6 
#elif defined(ESP8266)
#define MaxPinPort  18
#define MinPinPort   0
#define ADC_MAX_CHAN  1 
#endif      

#define ADC_MAX_ALARM ADC_MAX_CHAN * 4

#define MINBUSSCANINTERVAL 5  // minimum bus scan time in minutes
#define MINLORASCANINTERVAL 5  // minimum LoRa scan time in minutes

