Dougal121/Essence_of_Thor/ESP32Now/ESP32_I2ClIrrigationValve_Core3.ino
#include "StaticPages.h"

//                 0x11223344
#define MYVER 0x12435679     // change this if you change the structures that hold data that way it will force a "backinthebox" to get safe and sane values from eeprom
#define MYVER_NEW 0x12345681     // change this if you change the structures that hold data that way it will force a "backinthebox" to get safe and sane values from eeprom
const int button = 0;    //Push Button address / used to wake up wifi on remote nodes

const int MAX_EEPROM = 4096 ;
//const byte SETPMODE_PIN = D8 ; 
//const byte FLASH_BTN = D3 ;    // GPIO 0 = FLASH BUTTON 
//const byte SCOPE_PIN = D7 ;
const int PROG_BASE = 400 ;   // where the irrigation valve setup and program information starts in eeprom
const int PROG_BASE_NEW = 400 ;   // where the irrigation valve setup and program information starts in eeprom
const byte MAX_VALVE =  32 ;   // these two easily changed just watch the memory 
const byte MAX_BOARD_TYPES = 7 ; // number of types of IO available
const byte MAX_REM_LIST = 16 ; // number of remote nodes to monitor
const byte MAX_PROGRAM = 4 ;   // valves * program is the biggest memory number ... can do 32 x 4 OK but need to allocate more EEPROM
const byte MAX_FERT = 6 ;      // fertigation units MAXIUM of 8 <- DEAL & CODE BREAKER
const byte MAX_FILTER = 1 ;    // can have more but whats the point ? again max of 8
const byte MAX_CANISTERS = 5;  // maxium of 16 ?? limmit on what the editing page will process
const byte MAX_DESCRIPTION = 8 ;
const byte MAX_PROGRAM_HEADER = 16 ;  // these 2 are the new programmin array method ---- was only using 8 
const byte MAX_SHIFTS = 96 ;          // was 64 ....  
const byte MAX_STARTS = 4 ;
const int  MAX_MINUTES = 10080 ; // maximum minutes in a 7 day cycle
const byte MAX_BOARDS = 16 ;
const byte MAX_DAYS = 7 ;
const byte MAX_MONTHS = 12 ;
const byte MAX_WEEKS = 53 ;
const byte MAX_FERT_LOGS = 24 ;
const byte MAX_MCP23017 = 8 ;    // maximum number of these expanders on a system
const byte MAX_CNC = 15 ;
const byte MAX_NODES = 15 ;
const byte MAX_EXTRA_BOARD_BYTES = 5 ;

PCF8574 IOEXP[16]{0x20,0x21,0x22,0x23,0x24,0x25,0x26,0x27,0x38,0x39,0x3a,0x3b,0x3c,0x3d,0x3e,0x3f} ;
//SSD1306 display(0x3c, 4 ,15 );   // GPIO 5 = D1, GPIO 4 = D2   - onboard display 0.96" TTGO LaRa board
//SSD1306 display(0x3c, 21, 22);   // GPIO 5 = D1, GPIO 4 = D2   - onboard display 0.96" 
SH1106Wire display(0x3c, 21, 22);   // arse about ??? GPIO 5 = D1, GPIO 4 = D2  -- external ones 1.3"

RFManager  rf;
EspNowMesh mesh;
HC595_16 HCIO(14,13,12,5); // this is the 74HC595 on board I/O Relays

/*
   Basic pin reading and pullup test for the MCP23017 I/O expander
   Connect pin #12 of the expander to Analog 5 (i2c clock)
   Connect pin #13 of the expander to Analog 4 (i2c data)
   Connect pins #15, 16 and 17 of the expander to ground (address selection)
   Connect pin #9 of the expander to 5V (power)
   Connect pin #10 of the expander to ground (common ground)
   Connect pin #18 through a ~10kohm resistor to 5V (reset pin, active low)
   Output #0 is on pin 21 so connect an LED or whatever from that to ground
*/  
Adafruit_MCP23017 mcp[MAX_MCP23017] ;

typedef struct __attribute__((__packed__)) {             // permanent record
  int16_t TypeMaster;        // Always_On 0-1 normal-never_offline Domesitic_Water 0-1 normal-nofert Valve_Type 0-1 normal=master FeedBack 0-1 nofeedbak-feedback  and Master valve ID 0-63   3 bits + 6 bits
  uint8_t OnCoilBoardBit;    // 16 boards + 16 Outputs   4 + 4 bits
  uint8_t OffCoilBoardBit;   // 16 boards + 16 Outputs  4 + 4 bits
  uint8_t OnOffPolPulse ;    // 4 bits on 4 bits off pulse and polarity ie 1 + 3 x 50 ms + 50ms base 
  uint8_t FeedbackBoardBit;  // 16 Boards and 16 Outputs 4 + 4 bits
  uint8_t Fertigate ;        // 8 bits for tanks 0 -> 7
  uint8_t Filter;            // 8 bits for filters 0 -> 7  ie nomally 0 off 1 on
  uint8_t bEnable ;          // Enable 
  uint8_t Node ;             // send to node if non zero on node
  uint8_t Valve ;            // send to valve 
  float   Flowrate ;         // L/s  flow ??
  int16_t lDTTG  ;           // default minutes 
  int16_t lTTC ;             // time to clear the line in seconds from the last cycle 
  char    description[MAX_DESCRIPTION] ;   //
} valve_t ;                  // 27 bytes    (16x = 432 )

typedef struct __attribute__((__packed__)) {             // permanent record
  uint16_t Weekly[MAX_WEEKS];
  uint16_t Monthly[MAX_MONTHS]; 
  uint16_t Daily[MAX_DAYS];        // Daily Totals
} valve_totals_t ;                 // 64 bytes ( 16x = 1024 )        144 bytes ( 16x = 2304 )

typedef struct __attribute__((__packed__)) {             // permanent record
  time_t Weekly[MAX_WEEKS];      // have a date for the start of each period so ca tell if its been rolled over for reset purposes
  time_t Monthly[MAX_MONTHS]; 
  time_t Daily[MAX_DAYS];       
} valve_totals_dates_t ;         // 7 + 12 + 53 = 72    x 4 for long =>  288 byes  ie two of the ones above     


typedef struct __attribute__((__packed__)) {            // volitile stuff
  bool    bOnOff ;          // on off status
  uint8_t iFB    ;          // feedback status 
  int16_t lATTG  ;          // programed (automatic) minutes
  int16_t lTTG   ;          // minutes  
  int16_t lTTC ;            // time to clear the line after pump has last activated (seconds -- counts down)    
  bool    bNetOnOff ;       // network on off status
  float   dblMoisture ;     // current moisture level at probe
  float   dblTemp ;         // current soil temperature at probe  
  float   dblDepth ;         // current soil temperature at probe  
  time_t  mpTime ;          // last time moisture level  
} valve__t ;                // 21 bytes ish   

typedef struct __attribute__((__packed__)) {            // permanent record
  uint8_t AType ;           // top 4 bits 1 normal pump , 2 master pump , 3 chemical solenoid , 4 wash solenoid  --- bottom 3 bits master pump record if solenoide
  uint8_t DaysEnable ;      // seven days plus overall enable bit  bit 0 sun -->> bit 6 sat and bit 7 master enable
  float   CurrentQty ;      // how much is left to be pumped
  float   MaxQty ;          // Tank at full
  int16_t OnTime ;          // (seconds) this get multipled by the flow rate
  int16_t OffTime ;         // (seconds) this is used as is 
  float   BaseFlow ;        // this is a flow rate base divisor - I think ????
  float   PumpRate ;        // (l/s) pump rate obviously
  uint8_t BoardBit ;        // 16 boards + 16 Bits  --- what outpuut this is attached to.
  char    description[MAX_DESCRIPTION] ;  //
} fertigation_t ;           // 31 bytes   (8x = 248)

