Dougal121/Essence_of_Thor/ESP32Now/ESP32_I2ClIrrigationValve_Core3.ino
typedef struct __attribute__((__packed__)) {            // permanent record
  time_t  RecDate;      // have a date for the start of each period so ca tell if its been rolled over for reset purposes
  int32_t FertMixID ;   // mix or tank id 
  int32_t Valves ; 
  float   Amount ;
} fertigation_log_que_item_t ;                              // maybe need 50 of these ? x 16 bytes

typedef struct __attribute__((__packed__)) {            // volitile component 
  bool    bRun ;            // pump in run mode 
  bool    bEnable ;         // enable on / off
  bool    bOnOff ;          // on off status
  int16_t lTTG ;
  float   Flowrate ;
} fertigation__t ;          // 24 bytes

typedef struct __attribute__((__packed__)) {                        // Permanent record
  int16_t WashDelay ;                   // wash delay time in seconds   
  int16_t WashTime ;                    // wash time in seconds   
  uint8_t Enable ;                      // Enable filter program 
  uint8_t Canisters ;                   // number of filter can in the bank
  uint8_t bPol ;                        // Polarity of the 8 filter cans flush solenoids  
  uint8_t BoardBit[MAX_CANISTERS] ;     // 16 boards + 16 Bits
} filter_t ;                            // 15 bytes

typedef struct __attribute__((__packed__)) {            // volitile component
  int16_t lTTG ;
  uint8_t NextCan ;         // Next canister 
  bool    bOnOff ;          // on off status
  bool    bFlush ;          // Wash-true Wait-false 
} filter__t ;               //  bytes

typedef struct __attribute__((__packed__)) {         // permanent record
  uint16_t  starttime ;    // start time  8 bit + 8 bit   HH:MM
  uint16_t  runtime ;      // runtime in minutes
  uint8_t   wdays ;        // seven days plus overall enable bit 
} program_t ;            // 5 bytes

typedef struct __attribute__((__packed__)) {
  program_t p[MAX_PROGRAM];
} program_a ;                                  // 5 * 4 * 16 = 320

typedef struct __attribute__((__packed__)) {                        // Permanent record
  uint8_t Address;
  uint8_t Type;
  uint8_t Translate;
  uint8_t Extra[MAX_EXTRA_BOARD_BYTES];
} board_t ;                                            // 8 bytes total

typedef struct __attribute__((__packed__)) {           // Permanent record
  uint8_t IOPin[MAX_LOCAL_IO];
} local_t ;

typedef struct __attribute__((__packed__)) {           //  new programming system closer to what THOR is / does
  char      Description[MAX_DESCRIPTION] ;             // program numer is explicit as the array index
  uint8_t   WDays ;                                    // enable days + master enable
  int16_t   StartTime[MAX_STARTS] ;                    // start time  8 bit + 8 bit   HH:MM  
} program_header_t ;                                   // 17 bytes ?  by say 8 ==> 136 bytes    or 16 ==> 272 bytes

typedef struct __attribute__((__packed__)) {           // 
  uint8_t   Program ;                                  // 5 bit Shift No - 3 Bits Program No number (8 programs 32 shifts in each)
  uint32_t  ValveNo ;                                  // one bit for every valve  ?
  int16_t   RunTime ;                                  // runtime in minutes
} shift_new_t ;                                        // 4 bytes by say 32 or 64 ???  5 if uint16_t --- 7 if uint32_t    96 x 7  ===>  672

typedef struct __attribute__((__packed__)) {
  program_header_t ph[MAX_PROGRAM_HEADER];             // 136 -- only 8 programs   272 for 16
  shift_new_t      sh[MAX_SHIFTS] ;                    // 256 -- 64 valve shifts (same as before sort of)  320  or  448     or   672
  uint16_t         crc  ;                              // 2     1/2024 add this in so we can upload programs in one go
} program_new_t ;                                      // 294 whole new program structure so can be wriiten to eeprom in one go  456 or  584   ==>  946

program_new_t     pn;

board_t           eboard[MAX_BOARDS] ;   // board list - address and type
valve_t           evalve[MAX_VALVE] ;    // eprom backed up stuff 
program_a         vp[MAX_VALVE];
fertigation_t     efert[MAX_FERT] ;
filter_t          efilter[MAX_FILTER] ;  // eprom backed up stuff 
valve__t          vvalve[MAX_VALVE] ;    // volitile valve stuff
fertigation__t    vfert[MAX_FERT] ;      // volitile fertigation stuff
filter__t         vfilter[MAX_FILTER] ;  // volitile filter stuff
local_t           elocal ;
valve_totals_t    rtcVT[MAX_VALVE];      // to be read / stored in RTC board eeprom
valve_totals_t    rtcTest;               // compare so we dont write the whole thing...  
valve_totals_dates_t  rtcVTDates ;       // 
fertigation_log_que_item_t  flq[MAX_FERT_LOGS] ; // memory only structure

//class GeneralHousekeepingStuff {
//public:
typedef struct __attribute__((__packed__)) {     // eeprom stuff
  unsigned int localPort = 123;           // 2 local port to listen for NTP UDP packets
  unsigned int localPortCtrl = 8089;      // 4 local port to listen for Control UDP packets
  unsigned int RemotePortCtrl = 8089;     // 6 local port to listen for Control UDP packets
  uint8_t lProgMethod ;                   // 10
  uint8_t iSpread ;                       // LoRa Spread Factor
  uint8_t iTXPower ;                      // LoRa TX Power   
  uint8_t  meshChannel ;                  // WiFi Channel 
  uint8_t lPulseTime ;                    // 14  this is the gap between valves
  int     iFreq ;                         // LoRa Frequency
  uint8_t iUseNetwork ;                    // bit 0 use mesh , bit 1 use wifi
  long lMaxDisplayValve ;                 // 18
  long lNodeAddress ;                     // 22 
  IPAddress RCIP ;                        // (192,168,2,255)  30
  char NodeName[16] ;                     // 46 
  char nssid[16] ;                        // 62  
  char npassword[16] ;                    // 78
  time_t AutoOff_t ;                      // 82     auto off until time > this date   
//  long lDisplayOptions  ;               // 86 
  uint8_t lDisplayOptions ;               // 
  uint8_t cpufreq ;                       //         240 160 80   not flash at 26
  int displaytimer ;                      //         how log does the wifi stay on for (minutes) ?  0 fo display on always (display piggbacks on this)
  uint8_t gatewayMode ;                   //         Is this a gateway for the mesh network.
  uint8_t lNetworkOptions  ;              // 84 
  uint8_t ValveLogOptions  ;              // 85 
  uint8_t lFertActiveOptions  ;           // 86   was lSpare2
  char timeServer[24] ;                   // 110   = {"au.pool.ntp.org\0"}
  long  gmtOffset_sec = 10*3600;          // Adjust for your timezone offset in seconds
  int   daylightOffset_sec = 3600;        // Daylight saving offset in seconds
  char cssid[24] ;                        // 62
  char cpassword[16] ;                    // 126
  long lVersion  ;                        // 130
  IPAddress IPStatic ;                    // (192,168,0,123)   
  IPAddress IPGateway ;                   // (192,168,0,1)    
  IPAddress IPMask ;                      // (255,255,255,0)   
  IPAddress IPDNS ;                       // (192,168,0,15)     
  char servername[32] ;
  long SelfReBoot ;
  long lRebootTimeDay ;
  int     SolPulsePower ;
  int     SolContPower ; 
  int     SolMastPower ;
  char timePOSIXZone[32] ;                 //
}  general_housekeeping_stuff_t ;          // computer says it's   400 bytes
general_housekeeping_stuff_t ghks ;
/*
class GeneralHousekeepingStuff {
public:
  unsigned int localPort = 2390;          // 2 local port to listen for NTP UDP packets
  unsigned int localPortCtrl = 8666;      // 4 local port to listen for Control UDP packets
  unsigned int RemotePortCtrl = 8664;     // 6 local port to listen for Control UDP packets
  uint8_t lProgMethod ;                      // 10
  uint8_t iSpread ;                       // LoRa Spread Factor
  uint8_t iTXPower ;                      // LoRa TX Power   
  uint8_t  SPARE ;
  uint8_t lPulseTime ;                    // 14  this is the gap between valves
  int     iFreq ;                         //  LoRa Frequency
  uint8_t iBandWidth ;                    //  LoRa Bandwidth
  long lMaxDisplayValve ;                 // 18
  long lNodeAddress ;                     // 22 
  float fTimeZone ;                       // 26 
  IPAddress RCIP ;                        // (192,168,2,255)  30
  char NodeName[16] ;                     // 46 
  char nssid[16] ;                        // 62  
  char npassword[16] ;                    // 78
  time_t AutoOff_t ;                      // 82     auto off until time > this date   
//  long lDisplayOptions  ;               // 86 
  uint8_t lDisplayOptions ;
  uint8_t cpufreq ;                       //    240 160 80   not flash at 26
  int displaytimer ;                      //     how log does the wifi stay on for (minutes) ?  0 fo display on always (display piggbacks on this)
  uint8_t magsens ;                       //     magnet sensor sesitivity use instead of the button
  uint8_t lNetworkOptions  ;              // 84 
  uint8_t ValveLogOptions  ;              // 85 
  uint8_t lFertActiveOptions  ;           // 86   was lSpare2
  char timeServer[24] ;                   // 110   = {"au.pool.ntp.org\0"}
  char cpassword[16] ;                    // 126
  long lVersion  ;                        // 130
  IPAddress IPStatic ;                    // (192,168,0,123)   
  IPAddress IPGateway ;                   // (192,168,0,1)    
  IPAddress IPMask ;                      // (255,255,255,0)   
  IPAddress IPDNS ;                       // (192,168,0,15)     
  char servername[32] ;
  long SelfReBoot ;
  long lRebootTimeDay ;
  int     SolPulsePower ;
  int     SolContPower ; 
  int     SolMastPower ;
};          // computer says it's 
GeneralHousekeepingStuff ghks;
*/

typedef struct __attribute__((__packed__)) {     // eeprom stuff
  float ADC_Cal_Mul ;                            // 
  float ADC_Cal_Ofs ;                            //
  char  ADC_Unit[6] ;                            // units for display
  uint8_t ADC_Input_PIN ;
  int ADC_RAW ;
  float ADC_Value ;
} adc_chan_t ;                                   // 

typedef struct __attribute__((__packed__)) {     // eeprom stuff
  uint8_t  ADC_Channel ;
  uint8_t  ADC_Mode ;      // high low etc  
  float    ADC_Value ;     //
  uint16_t ADC_Delay ;     // trigger to alarm in seconds
  uint8_t  ADC_Action ;    // high low etc  
} adc_alarm_t ;                                   // 

typedef struct __attribute__((__packed__)) {     // eeprom stuff
  adc_chan_t chan[ADC_MAX_CHAN];
  adc_alarm_t alarm[ADC_MAX_ALARM] ;
} adc_stuff_t ;          // 

adc_stuff_t adcs ;

typedef struct __attribute__((__packed__)) {
  float   Flowrate ;          // L/s  flow ??
  int16_t lATTG  ;            // programed (automatic) minutes
  int16_t lTTG   ;            // minutes  
  int16_t lTTC ;              // time to clear the line after pump has last activated (seconds -- counts down)    
  int16_t Node ;
  uint8_t Fertigate ;         // 8 bits for tanks 0 -> 7
  uint8_t ValveNo ;
} cnc_v_t ;                   // 14 bytes

typedef struct __attribute__((__packed__)) {
  float   Flowrate ;          // L/s  flow ??
  int16_t lATTG  ;            // programed (automatic) minutes
  int16_t lTTG   ;            // minutes  
  int16_t lTTC ;              // time to clear the line after pump has last activated (seconds -- counts down)    
  uint8_t Fertigate ;         // 8 bits for tanks 0 -> 7
  uint8_t ValveNo ;
} mesh_cnc_v_t ;              // 14 bytes


typedef struct __attribute__((__packed__)) {
  uint8_t      cmd ;
  uint8_t      spare ;
  time_t       mc ;              // master clock
  uint8_t      snode ;           // source node
  uint8_t      valves ;          // number to follow
  cnc_v_t      cv[MAX_CNC] ;          // the most that we can have   15 x 14 = 210     16 x 14 = 224
  uint16_t     crc  ;
} cnc_t ;                        //     220   was     234 bytes

typedef struct __attribute__((__packed__)) {
  uint8_t      snode ;                // source node
  uint8_t      rssi;                  // tx nodes perception of the rx node
  uint8_t      dnode ;                // dest node
  uint8_t      valves ;               // number to follow
  mesh_cnc_v_t cv[MAX_CNC] ;          // the most that we can have   15 x 14 = 210     16 x 14 = 224
} mesh_cnc_t ;                        //     220   was     234 bytes

