Dougal121/Essence_of_Thor/ESP32Now/ESP32_I2ClIrrigationValve_Core3.ino
static_assert(sizeof(mesh_cnc_t) <= 250, "ESP-NOW overflow risk !!");

typedef struct __attribute__((__packed__)) {   // data request
  uint8_t      cmd ;                           // datat type 
  uint8_t      spare ;
  uint16_t     crc  ;                          // be shure its valid
} drq_t ;                        // 234 bytes

typedef struct __attribute__((__packed__)) {
  uint8_t      ValveNo ;
  uint8_t      Node ;
  uint8_t      Spare ;
  uint8_t      Depth ;
  float        Temp ;
  float        Wet ;          // % wetness ??
} wet_v_t ;                   // 12 bytes

typedef struct __attribute__((__packed__)) {
  uint8_t      cmd ;             // 43 for moisture monitor
  uint8_t      spare ;
  time_t       mc ;              // slave clock
  uint8_t      snode ;           // source node
  uint8_t      valves ;          // number to follow
  wet_v_t      mp[MAX_CNC] ;     // the most that we can have   16 x 12 = 192
  uint16_t     crc ;
} wet_t ;                        // 4 + 4 + 192 + 2 = 202 ?

typedef struct __attribute__((__packed__)) {
  uint8_t      cmd ;
  uint8_t      total ;        // 
  time_t       mc ;              // master clock
  uint8_t      snode ;           // source node
  uint8_t      uplinked ;        // number acted on
  int          Rssi ;
  long         FE ;
  float        Snr ;
  long         spare1 ;
  long         spare2 ; 
  uint16_t     crc ;
} cnc_ack_t ;                        // 28 bytes

cnc_ack_t cnc_ack;

typedef struct __attribute__((__packed__)) {
  int          node ;
  int          RxRssi ;
  float        RxSnr ;
  int          TxRssi ;
  float        TxSnr ;
  time_t       txt ;
  time_t       rxt ;
  uint8_t      total ;           // 
  uint8_t      uplinked ;        // number acted on
  long         TotalPackets ;
} cnc_nodes_t ;                  // 12 bytes

cnc_nodes_t   remlist[MAX_REM_LIST] ;

typedef struct __attribute__((__packed__)) {     // eeprom stuff 
  int  port;
  char server[48] ;
  char user[48] ;
  char password[48] ;
  char FROM[48] ;
  char TO[48] ;
  char CC[48] ;
  char BCC[48] ;
  bool bSecure ;
  char message[64] ;
  char subject[64] ;
  bool bUseEmail ;
  float LowTankQty ;
  bool bSpare ;
  int  iBusScanInterval ;
  int  iBusState[8] ; // 16 x 8 bits of bus state
  int  iLoRaScanInterval ;
  int  iLoRaTimeOut ;       // seconds > 120
} Email_App_stuff_t ;          

Email_App_stuff_t SMTP;

/*
typedef union  {                                  // super set union
  general_housekeeping_stuff_t ghks ;
  program_new_t         pn;
  board_t               eboard[MAX_BOARDS] ;   // board list - address and type
  valve_t               evalve[MAX_VALVE] ;    // eprom backed up stuff 
  program_a             vp[MAX_VALVE];
  fertigation_t         efert[MAX_FERT] ;
  filter_t              efilter[MAX_FILTER] ;  // eprom backed up stuff 
  local_t               elocal ;
  valve_totals_t        rtcVT[MAX_VALVE];      // to be read / stored in RTC board eeprom
  valve_totals_t        rtcTest;               // compare so we dont write the whole thing...  
  valve_totals_dates_t  rtcVTDates ;           // 
  adc_stuff_t           adcs ;
  Email_App_stuff_t     SMTP;
} ssu_t ;*/

//char cssid[32] = {"Configure_XXXXXXXX\0"} ;
char *host = "Control_00000000\0";                // overwrite these later with correct chip ID
char Toleo[10] = {"Ver 3.0\0"}  ;
char dayarray[8] = {'S','M','T','W','T','F','S','E'} ;
uint8_t mcp_relay_tranlate[16]={7,15,6,14,5,13,4,12,8,0,9,1,10,2,11,3} ;

char buff[BUFF_MAX]; 

IPAddress MyIP ;
IPAddress MyIPC  ;

//const int NTP_PACKET_SIZE = 48;       // NTP time stamp is in the first 48 bytes of the message
//byte packetBuffer[NTP_PACKET_SIZE];   //buffer to hold incoming and outgoing packets

struct tm timeinfo;
byte rtc_sec ;
byte rtc_min ;
byte rtc_hour ;
byte rtc_fert_hour ;
float rtc_temp ;
long lScanCtr = 0 ;
long lScanLast = 0 ;
bool bConfig = false ;
bool hasRTC = false ;
int  efertAddress ;
long lRebootCode = 0 ;
uint8_t rtc_status ;
struct ts tc;  
bool bPrevConnectionStatus = false;
unsigned long lTimeNext = 580000 ;           // next network retry 9 ish minutes from the start

int iTestBoard = 0 ;
int iTestMode = -1 ; 
int iTestTime = 3 ;
int iTestTimer = 0 ;
int iTestInc = 1 ; 
int iTestCoil = 0 ;
int bSaveReq = 0 ;
int iPowerTTG = 0 ;
uint64_t chipid = 0 ;
int iUploadPos = 0 ;
int iValveLogTTG = 60 ;
long  MyCheckSum ;
long  MyTestSum ;
/*int LoRaLastRssi = 0 ;
float LoRaLastSnr = 0 ;
long LoRaLastFrequencyError = 0 ; 
long LoRaTxPCnt = 0 ;
long LoRaRxPCnt = 0 ;
bool bSendLoRaCNCACK = false ;*/
bool bDoTimeUpdate = false ;
bool bSendTestEmail = false ;
bool bSendSaveConfirm = false ;
bool bValveLogDirty = false ; 
bool bDoFertUpload = false ;
bool bValveActive = false ; 
bool bValveActiveAny = false ; 
bool bValveTrans = false ; 
bool bManSet = true ;
bool bBusy = false ;
int iMailMsg = 0 ;

long lTimePrev ;
long lTimePrev2 ;
long lMinUpTime = 0 ;
long lMinBusScan = 30 ;
long lMinLoRaScan = 10 ;
long lRet_Email = 0 ;
float ADC_Value = 0 ;
int   ADC_Raw1 = 0 ; 
int   ADC_Raw2 = 0 ; 
bool  bSentADCAlarmEmail = false ;
long ADC_Trigger[ADC_MAX_ALARM]  ;
int   iAutoResetStatus = 0 ; 
bool bBusGood = true ;
bool bFertDisable = false ;
bool bTXWiFiCtrl = false ;
bool bTXMeshCtrl = false ; 
bool bMesh = false ;
bool bButton = false ;
bool bNeoPixel = false ;
int  iDisplayCountDown = -1 ;
int magval = 0 ;
uint8_t gChannel = 0;
String strBusResults ;
String strLoRaResults ;
WiFiUDP ntpudp;
WiFiUDP ctrludp;
WebServer server(80);

SMTPSession smtp;          // Declare the global used SMTPSession object for SMTP transport
ESP_Mail_Session session;  // Declare the global used ESP_Mail_Session for user defined session credentials
ModbusBackend modbus;

/*
void FloatToModbusWords(float src_value , uint16_t * dest_lo , uint16_t * dest_hi ) {
  uint16_t tempdata[2] ;
  float *tf ;
  tf = (float * )&tempdata[0]  ;
  *tf = src_value ;
  *dest_lo = tempdata[1] ;
  *dest_hi = tempdata[0] ;
}

float FloatFromModbusWords( uint16_t dest_lo , uint16_t dest_hi ) {
  uint16_t tempdata[2] ;
  float *tf ;
  tf = (float * )&tempdata[0]  ;
  tempdata[1] = dest_lo ;
  tempdata[0] = dest_hi  ;
  return (*tf) ;
}

