Dougal121/Essence_of_Thor/ESP32Now/ESP32_I2ClIrrigationValve_Core3.ino
int NumberOK (float target) {
  int tmp = 0 ;
  tmp = isnan(target);
  if ( tmp != 1 ) {
    tmp = isinf(target);
  }
  return (tmp);
}
*/
void ConfigureTime(){
  if (ghks.timePOSIXZone[0] != 0 )
    configTzTime(ghks.timePOSIXZone, ghks.timeServer);
  else
    configTime(ghks.gmtOffset_sec, ghks.daylightOffset_sec, ghks.timeServer);  
}


const char* GetResetReasonText(esp_reset_reason_t r)
{
    switch(r)
    {
        case ESP_RST_POWERON:   return "POWERON";
        case ESP_RST_EXT:       return "EXTERNAL";
        case ESP_RST_SW:        return "SOFTWARE";
        case ESP_RST_PANIC:     return "PANIC";
        case ESP_RST_INT_WDT:   return "INT WDT";
        case ESP_RST_TASK_WDT:  return "TASK WDT";
        case ESP_RST_BROWNOUT:  return "BROWNOUT";
        case ESP_RST_SDIO:      return "SDIO";
        default:                return "UNKNOWN";
    }
}

void setupDisplayInit()
{
  display.init();
  if (( ghks.lDisplayOptions & 0x01 ) != 0 ) {  // if bit one on then flip the display
    display.flipScreenVertically();
  }
}

void setupDisplayScreen()
{
  display.clear();
  display.setTextAlignment(TEXT_ALIGN_CENTER);  
  display.setFont(ArialMT_Plain_16);
  display.drawString(63, 0, F("Irrigation"));
  display.drawString(63, 16, F("Controler"));
  display.setFont(ArialMT_Plain_10);
  display.setTextAlignment(TEXT_ALIGN_LEFT);  
  display.drawString(0, 40, F("Copyright (c) 2026"));
  display.drawString(0, 50, F("Dougal Plummer"));
  display.setTextAlignment(TEXT_ALIGN_RIGHT);  
  display.drawString(127, 50, String(Toleo));
  display.setFont(ArialMT_Plain_10);
  display.display();
}


//  ############################################## SETUP  #################################################################  SETUP   #############################
void setup() {
int i , k , j = 0; 
float tmpbw = 125.0 ;
long  bw = 125000 ;
uint8_t OnPol ;
uint8_t OnPulse;
uint8_t OffPulse;


//  setCpuFrequencyMhz(240);    
  lRebootCode = random(1,+2147483640) ;  // want to change it straight away
  chipid=ESP.getEfuseMac();         //The chip ID is essentially its MAC address(length: 6 bytes).

  ghks.lMaxDisplayValve = MAX_VALVE ;
  Serial.begin(115200);
  Serial.setDebugOutput(false);  
  Serial.println("");          // new line after the startup burst

  SerialRS485.begin(9600, SERIAL_8N1, RS485_RX, RS485_TX);
  modbus.beginRTU(SerialRS485, 9600, RS485_DE);

 // esp_reset_reason_t r = esp_reset_reason();
 // Serial.printf("[BOOT] Reason: %s (%d)\n", GetResetReasonText(r), r);
  
  pinMode(ESP32_BUILTIN_LED,OUTPUT);  //  D4 builtin LED

  EEPROM.begin(MAX_EEPROM);
  Serial.println("LoadEEPROM Params...");
  LoadParamsFromEEPROM(true);
  if ( MYVER_NEW != ghks.lVersion ) {
    Serial.println("Mem Ver" + String(ghks.lVersion,HEX)+" Firmware Ver " + String(MYVER_NEW,HEX)+" Loading memory defaults...");
    BackInTheBoxMemory();         // load defaults if blank memory detected but dont save user can still restore from eeprom
    Serial.println("Loading memory defaults...");
    delay(200);
  }

   //reset OLED display via software
  pinMode(OLED_RST, OUTPUT);
  digitalWrite(OLED_RST, LOW);
  delay(20);
  digitalWrite(OLED_RST, HIGH);

  setupDisplayInit();

  if (( ghks.lDisplayOptions & 0x04 ) != 0 ) {  // use Fast LED
    FastLED.addLeds<NEOPIXEL, PIN_DATA>(leds, NUM_LEDS);  // GRB ordering is assumed
    bNeoPixel = true ;
  }
  pinMode(button, INPUT_PULLUP);  // set up the button
  
  /* show start screen */
  setupDisplayScreen();


  ClearRemoteNodeList();
  
  Serial.println("Memory Config...");
  for (i = 0 ; i < MAX_VALVE ; i++ ) {   // setup the defaults in the 3 volitile structs that support data comin back from eeprom
    vvalve[i].lATTG = 0 ;
    vvalve[i].lTTG = 0 ;
    vvalve[i].bOnOff = false ;
    vvalve[i].dblMoisture = 0.0 ;     // current moisture level at probe
    vvalve[i].dblTemp = 0.0 ;         // current soil temperature at probe  
    vvalve[i].dblDepth = 0.0 ;         // current soil temperature at probe  
    vvalve[i].mpTime = 0  ;          // last time moisture level      
  }

  for (i = 0 ; i < MAX_FERT ; i++ ) {
    vfert[i].bRun = false ;
    vfert[i].bEnable = false ;
    vfert[i].lTTG = 0 ;
    vfert[i].bOnOff = false ;
    vfert[i].Flowrate = 0.0 ;  
  }

  for (i = 0 ; i < MAX_FILTER ; i++ ) {
    vfilter[i].NextCan = 0 ;
    vfilter[i].bOnOff = false ;
    vfilter[i].bFlush = false ;
    vfilter[i].lTTG = 0 ;    
  }
   
  for ( i = 0 ; i < ADC_MAX_CHAN ; i++ ) {  // setup adc pins
    if (( adcs.chan[i].ADC_Input_PIN > MinPinPort) && (adcs.chan[i].ADC_Input_PIN < MaxPinPort )) {
      pinMode(adcs.chan[i].ADC_Input_PIN, INPUT);
//      Serial.println("Settimg Local Input ADC "+String(adcs.chan[i].ADC_Input_PIN));
    }
  }
  
  for ( i = 0 ; i < ADC_MAX_ALARM ; i++ ) {  // setup adc trigger values
    ADC_Trigger[i] = 0 ;
  }

  for (i = 0 ; i < MAX_MCP23017 ; i++ ) {   // initalise all the boards in the expander structure/array
      mcp[i].begin(i);              // initalise if board address as 0x20 -> 0x27
      for (j = 0 ; j < 16 ; j++ ){  // for the 16 bits
        mcp[i].pinMode(j, OUTPUT);  
        mcp[i].digitalWrite( j , true) ;   // relay board are generally false is on , true is off (arse about)           
      }
  }
        
  Serial.println("I/O Config...");
  for (i = 0 ; i < MAX_BOARDS ; i++ ) {
    switch ( eboard[i].Type ){
      case 0:  // PCF8574
        for ( j = 0 ; j < 16 ; j++ ) {
          if ( eboard[i].Address == IOEXP[j].getaddress() ) {   // check which boards are on what address
            IOEXP[j].begin(0xFF) ;                              // start all the I2C expanders and set outputs to high           
          }
        }
      break;
      case 1:  // MCP23017
        if ((eboard[i].Address >= 0x20 ) && (eboard[i].Address <= 0x27 )) {
          k = eboard[i].Address - 0x20 ;  // this is the translated address
//          mcp[i].begin(k);              // initalise if board address is between the bounds
          for (j = 0 ; j < 16 ; j++ ){    // for the 16 bits
            if (CheckIfMCPInput(i,j)){
              mcp[k].pinMode(j, INPUT);
            }else{
              mcp[k].pinMode(j, OUTPUT);  
              mcp[k].digitalWrite( j , true) ;   // relay board are generally false is on , true is off (arse about)           
            }
          }
        }  
      break;
      case 2:  // Local I/O Pins
          for (j = 0 ; j < MAX_LOCAL_IO ; j++ ){  // for the 16 bits
            if (( elocal.IOPin[j] != 255 ) && ( elocal.IOPin[j] >= 0 ) && (LocalPINOK(elocal.IOPin[j]))){       // look at this for use
              if (CheckIfMCPInput(i,j)){
                pinMode(elocal.IOPin[j], INPUT);
//                Serial.println("Settimg Local Input GPIO "+String(elocal.IOPin[j]));
              }else{
                pinMode(elocal.IOPin[j], OUTPUT);                
//                Serial.println("Setting Local Output GPIO "+String(elocal.IOPin[j]));
              }
            }
          }
      break;
      case 3:  // None
      break ;
      case 4:  // HC595   initalise if we are using this   doesn't/shouldn't matter if we call it twice...   use extra bytes if
        if ((eboard[i].Extra[0]!=0) && (eboard[i].Extra[1]!=0)&& (eboard[i].Extra[2]!=0)&& (eboard[i].Extra[3]!=0))
          HCIO.begin(eboard[i].Extra[0],eboard[i].Extra[1],eboard[i].Extra[2],eboard[i].Extra[3] );
        else
          HCIO.begin();       
      break;
    }
  }
  j = 0 ;
  ZeroFertQue();  

