Dougal121/Essence_of_Thor/ESP32Now/ESP32_I2ClIrrigationValve_Core3.ino
  for (i = 0 ; i < MAX_VALVE ; i++ ) {   // setup the defaults in the 3 volitile structs that support data comin back from eeprom
    OnPol = ((evalve[i].OnOffPolPulse & 0x80  ) >> 7  ) ;    
    OnPulse = SolPulseWidth((int)((evalve[i].OnOffPolPulse & 0x70  ) >> 4  )) ;
    OffPulse = SolPulseWidth((int)((evalve[i].OnOffPolPulse & 0x07  )  )) ;
    if ( evalve[i].OffCoilBoardBit == evalve[i].OnCoilBoardBit ) {  // powered coil
      ActivateOutput((( evalve[i].OffCoilBoardBit & 0xf0 ) >>4 ) , (evalve[i].OffCoilBoardBit & 0x0f ) , !OnPol , 0 ) ;  // was offpol but not usefull    
    }else{  // pulse coil
//    Serial.println( String(i) + " OnPol " + String(OnPol));
//      ActivateOutput((( evalve[i].OnCoilBoardBit & 0xf0 ) >>4 ) , (evalve[i].OnCoilBoardBit & 0x0f ) , OnPol , OnPulse ) ;
//      ActivateOutput((( evalve[i].OffCoilBoardBit & 0xf0 ) >>4 ) , (evalve[i].OffCoilBoardBit & 0x0f ) , OnPol , OffPulse ) ;  // was offpol but not usefull
      ActivateOutput((( evalve[i].OnCoilBoardBit & 0xf0 ) >>4 ) , (evalve[i].OnCoilBoardBit & 0x0f ) , !OnPol , 0 ) ;
      ActivateOutput((( evalve[i].OffCoilBoardBit & 0xf0 ) >>4 ) , (evalve[i].OffCoilBoardBit & 0x0f ) , !OnPol , 0 ) ;  // was offpol but not usefull
    }
  }
  
  if (( ghks.SolContPower & 0x8000 ) != 0 ) {
    OnPol = ((ghks.SolContPower & 0x4000  ) >> 14  ) ;
    ActivateOutput((( ghks.SolContPower & 0xf0 ) >> 4 ) , (ghks.SolContPower & 0x0f ) , !OnPol , 0 ) ;      
  }
  if (( ghks.SolMastPower & 0x8000 ) != 0 ) {
    OnPol = ((ghks.SolMastPower & 0x4000  ) >> 14  ) ;
    ActivateOutput((( ghks.SolMastPower & 0xf0 ) >> 4 ) , (ghks.SolMastPower & 0x0f ) , !OnPol , 0 ) ;      
  }
  if (( ghks.SolPulsePower & 0x8000 ) != 0 ) {
    OnPol = ((ghks.SolPulsePower & 0x4000  ) >> 14  ) ;
    ActivateOutput((( ghks.SolPulsePower & 0xf0 ) >> 4 ) , (ghks.SolPulsePower & 0x0f ) , !OnPol , 0 ) ;              
  }
  
//  delay(1000);
//  Serial.println("Chip ID " + String(chipid, HEX));




  Serial.println("Configuring WiFi...");
//  WiFi.onEvent([](WiFiEvent_t event)  {   Serial.printf("WiFi Event: %d\n", event);  });   // print event numbers as diagnositcs

  //StartWiFi();
  RFManager::Config config;
  config.defaultChannel = ghks.meshChannel ;
  config.cssid = ghks.cssid ;
  config.nssid = ghks.nssid ;
  config.npassword = ghks.npassword ;
  config.chipid = chipid ;
  config.IPStatic = ghks.IPStatic ;
  config.IPGateway = ghks.IPGateway ; 
  config.IPMask = ghks.IPMask ;
  config.IPDNS = ghks.IPDNS ;
  config.lNetworkOptions = ghks.lNetworkOptions ;
  if ( !rf.begin(ghks.lNodeAddress, config ))
    Serial.println("WiFi didn't start!!");
  config.defaultChannel = rf.getChannel();
  rf.attachMesh(&mesh);
  bMesh = mesh.begin(ghks.lNodeAddress, ghks.gatewayMode,config.defaultChannel);
  mesh.onData(MeshDataHandler);
  gChannel = config.defaultChannel ; 

  if (ghks.localPortCtrl == ghks.localPort ){             // bump the NTP port up if they ar the same
    ghks.localPort++ ;
  }

    Serial.println("Local UDP port: ");
    ctrludp.begin(ghks.localPortCtrl);                 // recieve on the control port

    Serial.println("Control Local UDP port: ");
//    Serial.println(ctrludp.localPort());
                                                // end of the normal setup
 
//  sprintf(host,"Control_%08X\0",chipid);
//  if (MDNS.begin(host)) {
//    MDNS.addService("http", "tcp", 80);
//    Serial.println("MDNS responder started");
//    Serial.print("You can now connect to http://");
//    Serial.print(host);
//    Serial.println(".local");
//  }

  server.on("/", handleRoot);
  server.on("/setup", handleSetup);
  server.on("/filt", handleFilt);
  server.on("/fert", handleFert);
  server.on("/vsss", handleVSSS);
  server.on("/prog", handleRoot);
  server.on("/prognew", handleProgramNew);
  server.on("/scan", i2cScan);
  server.on("/iosc", ioScan);
  server.on("/stime", handleSTime);
  server.on("/btest", handleBTest);
  server.on("/info", handleInfo);
  server.on("/email", DisplayEmailSetup);
  server.on("/fertque", DisplayShowFertQue);  
  server.on("/iolocal", ioLocalMap);
  server.on("/adc", adcLocalMap);
  server.on("/eeprom", DisplayEEPROM);
  server.on("/rtceeprom",DisplayRTCEEPROM);  
  server.on("/valvelog",DisplayValveLog);
  server.on("/valvelog.csv", HTTP_GET , DisplayValveLog);  
  server.on("/backup", HTTP_GET , handleBackup);
  server.on("/backup.txt", HTTP_GET , handleBackup);
  server.on("/backup.txt", HTTP_POST,  handleRoot, handleFileUpload); 
/*  server.on("/login", HTTP_GET, []() {
    server.sendHeader("Connection", "close");
    server.send(200, "text/html", loginIndex);
    Serial.printf("Display Login Page");
  });*/
  server.on("/update", HTTP_GET, []() {
    SendHTTPHeader();
    server.sendContent(F("<h4><b>ESP32 Firmware Upload</b></h4><br>"));
    server.sendContent(updatePage);
    SendHTTPPageFooter();
//    server.sendHeader("Connection", "close");
//    server.send(200, "text/html", updatePage);
  });
  server.on("/update", HTTP_POST, []() {   //handling uploading firmware file
    server.sendHeader("Connection", "close");
    server.send(200, "text/plain", (Update.hasError()) ? "FAIL" : "OK");
    ESP.restart();
  }, []() {
    HTTPUpload& upload = server.upload();
    if (upload.status == UPLOAD_FILE_START) {
      Serial.printf("Update: %s\n", upload.filename.c_str());
      if (!Update.begin(UPDATE_SIZE_UNKNOWN)) { //start with max available size
        Update.printError(Serial);
      }
    } else if (upload.status == UPLOAD_FILE_WRITE) {
      
      if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {   // flashing firmware to ESP
        Update.printError(Serial);
      }
    } else if (upload.status == UPLOAD_FILE_END) {
      if (Update.end(true)) { //true to set the size to the current progress
        Serial.printf("Update Success: %u\nRebooting...\n", upload.totalSize);
      } else {
        Update.printError(Serial);
      }
    }
  });
  
  server.onNotFound(handleNotFound);  
  server.begin();
  Serial.println("HTTP server started");
 

   // Initialize NTP
  if (WiFi.isConnected()){  // Set update every 24 hours
      ConfigureTime();

    // Wait for time to be set
    if (!getLocalTime(&timeinfo)) {
      Serial.println("Failed to obtain time");
      return;
    }else{
      // Print current time
      Serial.println(&timeinfo, "%A, %B %d %Y %H:%M:%S");
    }
  }

//  dnsServer.setTTL(300);
//  dnsServer.setErrorReplyCode(DNSReplyCode::ServerFailure);
//  dnsServer.start(53,"injector.local",myIP);
  tc.mon = 0 ;
  tc.wday = 0 ;
  DS3231_init(DS3231_INTCN); // look for a rtc
  DS3231_get(&tc);
  rtc_status = DS3231_get_sreg();
  if (((tc.mon < 1 ) || (tc.mon > 12 )) && ((tc.wday > 8)||(tc.wday < 1))) { // no rtc to load off
    Serial.println("NO RTC ?");
  }else{
///    setTime((int)tc.hour,(int)tc.min,(int)tc.sec,(int)tc.mday,(int)tc.mon,(int)tc.year ) ; // set the internal RTC
    struct tm timeinfo = {};
    timeinfo.tm_year = tc.year - 1900;
    timeinfo.tm_mon  = tc.mon - 1;
    timeinfo.tm_mday = tc.mday;
    timeinfo.tm_hour = tc.hour;
    timeinfo.tm_min  = tc.min;
    timeinfo.tm_sec  = tc.sec;

