Dougal121/Essence_of_Thor/ESP32Now/ESP32_I2ClIrrigationValve_Core3.ino
    time_t t = mktime(&timeinfo);
    struct timeval tv = { .tv_sec = t, .tv_usec = 0 };
    settimeofday(&tv, nullptr);    
    hasRTC = true ;
    Serial.println("Has RTC ?");
    rtc_temp = DS3231_get_treg(); 
  }
  rtc_min = tc.min ; //minute();
  rtc_sec = tc.sec ; //second();

  randomSeed(time(NULL));                       // now we prolly have a good time setting use this to reroll the dice for reboot code
  lRebootCode = random(1,+2147483640) ;
/*
  LoRa.setPins(SS, RST, DIO0); 
  tmpbw = BandWidthText(ghks.iBandWidth).toFloat() * 1000 ;
  bw = (long) tmpbw ;
  
  Serial.print("Starting LoRa ");    
  while (!LoRa.begin(ghks.iFreq * 100000 ) && (j < 10)) 
  {
    Serial.print(".");
    j++;
    delay(500);
  }
  
  if (j == 10) {
    Serial.println(" failed");    
    bLoRa = false ;
  }else{
    Serial.println(" ok");    
    Serial.println("Setting LoRa Bandwidth/power/spreading factor ");
    LoRa.setSignalBandwidth(bw) ;
    LoRa.setTxPower((int)ghks.iTXPower)  ;
    LoRa.setSpreadingFactor((int)ghks.iSpread)  ;
    Serial.println("LoRa Initialization OK");  
    bLoRa = true ;
  }
  if (!bLoRa){
    if ( mesh.begin(ghks.lNodeAddress,gChannel,true) ){
      bMesh = true ;
      mesh.clearNodeList();
      mesh.onData(MeshDataHandler);
      Serial.println("Mesh Initialization OK");  
    }
  }
//  SetSelectedSpeed();
*/
  iDisplayCountDown = ghks.displaytimer ;   // turn on display

  iValveLogTTG = ((int)(ghks.ValveLogOptions & 0x3f) ) * 10 + 20 ;
  if ( hasRTC ){
    ReadValveLogsFromEEPROM();  // read in the valve log data
  }
  
  Serial.println("Setup Finished");    
//  Serial.println("ghks as a type " + String(sizeof(ghks)));
//  Serial.println("ghks as a class " + String(sizeof(ghksc)));
}

void loopDisplaySecond(){
  int x = 0 , y = 0 ; 
    display.clear();
    if ( iTestMode != -1 ){                      // board test mode
      display.setTextAlignment(TEXT_ALIGN_RIGHT);                   // put an indicator up to show we are in this mode
      display.drawString(127 , 30, "Testing " + String(iTestBoard));              
      display.setTextAlignment(TEXT_ALIGN_RIGHT);                   // put an indicator up to show we are in this mode
      if (iTestMode == -1 ) {
        display.drawString(127 , 41, "Done !!!" );
      }else{
        display.drawString(127 , 41, String(iTestMode));
      }
    }  
    display.setTextAlignment(TEXT_ALIGN_LEFT);
    snprintf(buff, BUFF_MAX, "%d/%02d/%02d %02d:%02d:%02d", timeinfo.tm_year+1900, timeinfo.tm_mon+1, timeinfo.tm_mday , timeinfo.tm_hour, timeinfo.tm_min, timeinfo.tm_sec);
    display.drawString(0 , LineText, String(buff) );
    display.setTextAlignment(TEXT_ALIGN_RIGHT);
    if (WiFi.isConnected())  {
      display.drawString(127 , LineText, String(WiFi.RSSI()));
    }else{
      display.drawString(127 , LineText, "-X-");
    }
    
    if ( bBusGood ){
    }else{
      display.drawString(127 , 42, String("-BUS-"));    
      if (( rtc_sec % 2 ) == 0 ){
        display.setColor(INVERSE);
        display.fillRect(95, 42, 32, 12);
      }
    }
    
    display.setTextAlignment(TEXT_ALIGN_CENTER);
    int i = ( rtc_sec >> 1 ) % 10 ;
    switch (i){
      case 1:
        MyIP =  WiFi.localIP() ;  // update to see if has connection                  
        snprintf(buff, BUFF_MAX, "IP %03u.%03u.%03u.%03u", MyIP[0],MyIP[1],MyIP[2],MyIP[3]);      
      break;
      case 2:
        snprintf(buff, BUFF_MAX, ">>  IP %03u.%03u.%03u.%03u <<", MyIPC[0],MyIPC[1],MyIPC[2],MyIPC[3]);            
      break;
      case 3:
       snprintf(buff, BUFF_MAX, "%s - %d", ghks.NodeName,ghks.lNodeAddress );   
      break;
      case 4:
       snprintf(buff, BUFF_MAX, "Up Time %d:%02d:%02d",(lMinUpTime/1440),((lMinUpTime/60)%24),(lMinUpTime%60));
      break;
      case 5:
        switch (iAutoResetStatus){
          case -1: snprintf(buff, BUFF_MAX, "Auto Reboot %d",( ghks.lRebootTimeDay & 0xfff )); break ;
          case -2: snprintf(buff, BUFF_MAX, "Auto Reboot Today %d",( ghks.lRebootTimeDay & 0xfff )); break ;
          case -3: snprintf(buff, BUFF_MAX, "REBOOT IN ONE MINUTE"); break ;
          case 1: snprintf(buff, BUFF_MAX, "Reboot interval %d min", ghks.SelfReBoot ); break ;
          case 2: snprintf(buff, BUFF_MAX, "Auto Reboot in %d min", (ghks.SelfReBoot - lMinUpTime )); break ;
          case 3: snprintf(buff, BUFF_MAX, "REBOOT IN ONE MINUTE"); break ;
          default: snprintf(buff, BUFF_MAX, "Auto Reboot OFF") ; break;
        }
      break;
      case 6:
        if ( strBusResults.length() == 0 ){
          snprintf(buff, BUFF_MAX, "--- I2C BUS NORMAL ---" );
        }else{
          snprintf(buff, BUFF_MAX, "%s", strBusResults.c_str() );
        }
      break;  
      case 7:
        if ( bMesh ){
          snprintf(buff, BUFF_MAX, "### ESPNow Active ###" );
        }
      break;    
      case 8:
        snprintf(buff, BUFF_MAX, "WiFi Chan %d", gChannel );            
      break;    
      case 9:   // want to mesh stuff in here - not finished
        snprintf(buff, BUFF_MAX, "Mesh %d", gChannel );            
      break;    
      default:
        snprintf(buff, BUFF_MAX, "%s", ghks.cssid );            
      break;
    }
    display.drawString(64 , 53 ,  String(buff) );
    if (( abs(iAutoResetStatus) == 3 ) && (i == 5)) {
       display.setColor(INVERSE);
       display.fillRect(0, 53, 128, 11);            
    }
    if ( iTestMode == -1 ){   // test mode uses this area as well so dont display in test mode
      display.setTextAlignment(TEXT_ALIGN_RIGHT);
      display.drawString(128 , 33 ,  String(adcs.chan[0].ADC_Value,1)+ String(" (") +String(adcs.chan[0].ADC_Unit)+ String(" )") );
      if ( bSentADCAlarmEmail ){
        display.setTextAlignment(TEXT_ALIGN_LEFT);
        display.drawString(128 , 43 ,  String("*") );      
      }
      for (int i = 0 ; i < ADC_MAX_ALARM ; i++ ) {      
        if ( ADC_Trigger[i] > 0 ) {
           display.drawString(128 , 43 , String(iMailMsg) + "-" + String(ADC_Trigger[i]) + " / " + String(adcs.alarm[i].ADC_Delay) );
           display.setColor(INVERSE);
           display.fillRect(64, 33, 64, 21);
        }
      }
    }

    for (int i = 0 ; i < MAX_VALVE ; i++ ) {              // scan all the valves for masters then look for matching subordinates then update TTGS from them if required
      if ( i < 16 ) {
        x = i * 8 ;
        y = 15 ;       
      }else{
        x = (i-16) * 8 ;
        y = 23 ;       
      }  
      if ( vvalve[i].bOnOff ){   // valve on       
        if (( evalve[i].TypeMaster & 0x40 ) != 0x00  ){  // look if it has feedback
          display.drawCircle(x+3, y, 3);
          display.drawLine(x+1, y - 2, x+5, y + 2);
          display.drawLine(x+1, y + 2, x+5, y - 2);        
        }else{
          display.fillCircle(x+3, y, 3);
        }  
      }else{                      // valve off
        if (( vvalve[i].iFB & 0x01 ) != 0x00  ){   // feedback status as if it is off or not
          display.drawCircle(x+3, y, 3);
        }else{  
          display.drawCircle(x+3, y, 1);
        }
      }
    }                                                        // end first pass of valves
    for (int i = 0 ; i < MAX_FERT ; i++ ) { 
      if ( efert[i].CurrentQty > 0 ) {          
        if ( vfert[i].bRun ){
          display.fillCircle(i*8+3, 33, 3);
        }else{
          display.drawCircle(i*8+3, 33, 1);
        }      
      }else{
          display.drawCircle(i*8+3, 33, 3);    
      }
      if ( vfert[i].bOnOff ){
        display.fillCircle(i*8+3, 41, 3);
      }else{
        display.drawCircle(i*8+3, 41, 1);
      }       
    }
    if (( iDisplayCountDown == 0 ) && ( ghks.displaytimer > 0 ) && ((ghks.lDisplayOptions & 0x02 ) != 0 )){
 //     display.clear();  // turn off all the pixels  ??? required as we never send them out the bus
    }else{  
      display.display();
    }
}

