Dougal121/Essence_of_Thor/ESP32Now/ESP32_I2ClIrrigationValve_Core3.ino
void loopStatusLEDSecond(){
    if (bNeoPixel){  
      if (bTXMeshCtrl){
        leds[0] = CRGB::Purple ;   //  CRGB(255, 0, 0); 
        bTXMeshCtrl = false ;
      }
      else{
        if (bTXWiFiCtrl){
          leds[0] = CRGB::Cyan ;
          bTXWiFiCtrl = false ; 
        }
        else{
          if (mesh.getRelayBlink()){
            leds[0] = CRGB::Red ;
          }
          else{
            if (mesh.getRXBlink()){
              leds[0] = CRGB::Green ;
            }
            else{
              if (WiFi.isConnected())  {
                if ( leds[0].b != 0 )
                  leds[0] = CRGB::Black ;
                else
                  leds[0] = CRGB::Blue ;
              }
              else{
                if (( rtc_sec % 4 ) != 0 )    {
                  leds[0] = CRGB::Black ;
                }else{
                  leds[0] = CRGB::Blue ;
                }
              }
            }
          }
        }
      }
      FastLED.show();      
    }
    else{
      if (WiFi.isConnected())  {
        digitalWrite(ESP32_BUILTIN_LED,!digitalRead(ESP32_BUILTIN_LED));
      }else{
        if (( rtc_sec % 4 ) == 0 )    {
          digitalWrite(ESP32_BUILTIN_LED,true);        
        }else{
          digitalWrite(ESP32_BUILTIN_LED,false);                
        }
      }
    }
}
//  ##############################  LOOP   #############################  LOOP  ##########################################  LOOP  ###################################
void loop() {
long lTime ;  
long lRet ;
int i , j , k  ;
int board ;
uint8_t OnPol ;
uint8_t OffPol ;
int OnPulse ;
int OffPulse ;
bool bSendCtrlPacket = false ;
bool bDirty = false ;
bool bDirty2 = false ;
long lTD ;

int iHM = 0 ; 
int iDOW = 0 ;
int iRebootTime = 0 ;
time_t NowTime ;
time_t MaxTime ;
int iBusReturn = 0 ;
//int iLoRaReturn = 0 ;

/*
  if ( iDisplayCountDown != 0 ){
    if ( ghks.cpufreq < 240 ){     // use    ghks.cpufreq   ???? faster 
      setCpuFrequencyMhz(240);
    }
  }*/
  lTime = millis() ;
  getLocalTime(&timeinfo);
  server.handleClient();

//  SetSelectedSpeed();
  
//  magval = hallRead();  // check for magnets near by ( wake up signal but the bare chip doesnt have one ONLY the silver modules )
  lTime = millis() ;
  iTestTime = constrain(iTestTime,2,50);
  iTestMode = constrain(iTestMode,-1,16);
/*  if (digitalRead(FLASH_BTN) == LOW) { // what to do if the button be pressed
  }*/
      
  lScanCtr++ ;
//  bSendCtrlPacket = false ;
  if ( rtc_sec != timeinfo.tm_sec){

    if ( iTestMode != -1 ){                      // board test mode
      if (eboard[iTestBoard].Type==4)
        ActivateOutput(iTestBoard,iTestCoil,HIGH,(ghks.lPulseTime % 128 ));  
      else
        ActivateOutput(iTestBoard,iTestCoil,LOW,(ghks.lPulseTime % 128 ));  
      iTestTimer++ ; // count the econd while in test mode
      if (( iTestTimer % iTestTime ) == ( iTestTime - 1 )){       
        iTestMode++ ;
        if ( iTestInc == 1 ) {
          iTestCoil++ ;    // increment the coil
          if ( iTestCoil >= MaxBoardOutputs(iTestBoard )){
            iTestCoil = 0 ;
          }
        }
        if ( iTestMode >= MaxBoardOutputs(iTestBoard )){
          iTestMode = -1 ; // switch off if we have done all 16 channels
        }
      }
    }  

    MaxTime = now() + 2 ;                                            // PEEK AT THE FUTURE FOR SWITCHING TRANSIENTS 
    if (ghks.lProgMethod == 0 ){
      UpdateATTG(MaxTime) ;                                         
    }else{
      UpdateATTGNew(MaxTime) ;                                      
    }   
    bValveTrans = false ;
    for (i = 0 ; i < MAX_VALVE ; i++ ) {              // scan all the valves for masters then look for matching subordinates then update TTGS from them if required
      if (((vvalve[i].lTTG > 0 )|| (vvalve[i].lATTG > 0))&&(!vvalve[i].bOnOff)){
        if ( evalve[i].OffCoilBoardBit != evalve[i].OnCoilBoardBit ) {                     // 16 x  8 bit expanders
            bValveTrans = true ;
        }        
      }
      if ((vvalve[i].lTTG <= 0 )&&(vvalve[i].lATTG <= 0 )&&(vvalve[i].bOnOff)){
        if ( evalve[i].OffCoilBoardBit != evalve[i].OnCoilBoardBit ) {
            bValveTrans = true ;
        }
      }
    }
    
    if (( ghks.SolPulsePower & 0x8000 ) != 0 ) {
      OnPol = ((ghks.SolPulsePower & 0x4000  ) >> 14  ) ;
      if ( bValveTrans ) {
        bValveTrans = false ;
        iPowerTTG = 3 ;
        ActivateOutput((( ghks.SolPulsePower & 0xf0 ) >> 4 ) , (ghks.SolPulsePower & 0x0f ) , OnPol , 0 ) ;
        delay(100); 
      }
      if (iPowerTTG > 0 ) {
        iPowerTTG-- ;
        if (iPowerTTG == 0 ) {
          ActivateOutput((( ghks.SolPulsePower & 0xf0 ) >> 4 ) , (ghks.SolPulsePower & 0x0f ) , !OnPol , 0 ) ;              
        }
      }
    }
    
    MaxTime = now() ;
    if (ghks.lProgMethod == 0 ){
      UpdateATTG(MaxTime) ;                                          // update the program switching Time To Go timers
    }else{
      UpdateATTGNew(MaxTime) ;                                       // update the program switching Time To Go timers      
    }   
    bValveActive = false ;
    bValveActiveAny = false;
    
    for (i = 0 ; i < MAX_VALVE ; i++ ) {              // scan all the valves for masters then look for matching subordinates then update TTGS from them if required
      if (( evalve[i].TypeMaster & 0x80 ) != 0 ){             // This is the master valve check
        vvalve[i].lTTG = 0 ;
        if ( evalve[i].Node != 0 ){
           evalve[i].Fertigate = 0 ;
           evalve[i].Flowrate = 0 ;
        }
        for (k = 0 ; k < MAX_VALVE ; k++ ) {                  // scan the list again  
          j = ( evalve[k].TypeMaster & 0x3f ) - 1 ;           // look for a subordinate valve
          if (j == i){
            if ( evalve[i].bEnable ){
              if ( vvalve[i].lATTG < vvalve[k].lATTG ){
                vvalve[i].lATTG = vvalve[k].lATTG ;
              }
            }  
            if ( vvalve[i].lTTG < vvalve[k].lTTG ){
              vvalve[i].lTTG = vvalve[k].lTTG ;
            }
            if (((vvalve[k].lTTG > 0 )||(vvalve[k].lATTG)) && ( evalve[i].Node != 0 )){  // if subordinate going then add the other stuff
              evalve[i].Fertigate |= evalve[k].Fertigate ;
              evalve[i].Flowrate += evalve[k].Flowrate ;
            }
          }    
        }
      }      

