Dougal121/Essence_of_Thor/ESP32Now/ESP32_I2ClIrrigationValve_Core3.ino
      if ( vvalve[i].bOnOff ){   // valve on
        bValveActiveAny = true ;
        if (( evalve[i].TypeMaster & 0x80 ) != 0x00  ){
          bValveActive = true ;
        }          
      }
      if ( vvalve[i].lTTC > 0 ){   // decriment the seconds to clear  --- first pass
        vvalve[i].lTTC--;
        bDirty2 = true ;
      }
    }                                                        // end first pass of valves
    for (i = 0 ; i < MAX_FERT ; i++ ) { 
      if ( vfert[i].bOnOff ){
        bDirty = true ;
      }      
    }
    
    loopDisplaySecond();

    for (i = 0 ; i < MAX_VALVE ; i++ ) {
      if ( bDirty ) {
        vvalve[i].lTTC = evalve[i].lTTC ;                                          // if dirty then start all the timers again
      }
      if (( evalve[i].TypeMaster & 0x40 ) == 0 ){                                 // do feeback first
        if ( vvalve[i].bOnOff ){
          vvalve[i].iFB  = 0xff ; 
        }else{
          vvalve[i].iFB  = 0xfe ;                
        }
      }else{
//        vvalve[i].iFB  = 0x01 & !IOEXP[((evalve[i].FeedbackBoardBit & 0xf0 ) >> 4 )].readButton((evalve[i].FeedbackBoardBit & 0x0f ));              
        vvalve[i].iFB  = 0x01 & GetIntput(((evalve[i].FeedbackBoardBit & 0xf0 ) >> 4 ) , (evalve[i].FeedbackBoardBit & 0x0f ));
      }
      OnPol = ((evalve[i].OnOffPolPulse & 0x80  ) >> 7  ) ;
      OffPol = ((evalve[i].OnOffPolPulse & 0x08  ) >> 3  ) ;
      OnPulse = SolPulseWidth((int)((evalve[i].OnOffPolPulse & 0x70  ) >> 4  )) ;
      OffPulse = SolPulseWidth((int)((evalve[i].OnOffPolPulse & 0x07  )  )) ;
//      OnPol = LOW ;
//      OffPol = HIGH ;
//      OnPulse =  ghks.lPulseTime % 128 ;
//      OffPulse =  ghks.lPulseTime % 128 ;
      if (((vvalve[i].lTTG > 0 )|| (vvalve[i].lATTG > 0))&&(!vvalve[i].bOnOff)){
        vvalve[i].bOnOff = true ;
        board = ( evalve[i].OnCoilBoardBit & 0xf0 ) >> 4 ; 
        board = 0 ;                                                                        // hard code for the moment
        if ( evalve[i].OffCoilBoardBit == evalve[i].OnCoilBoardBit ) {                     // 16 x  8 bit expanders
//          IOEXP[board].write( evalve[i].OnCoilBoardBit , OnPol );                        // hold on 
          ActivateOutput((( evalve[i].OnCoilBoardBit & 0xf0 ) >>4 ) , (evalve[i].OnCoilBoardBit & 0x0f ) , OnPol , 0 ) ;
        }else{
//          IOEXP[board].pulsepin( evalve[i].OnCoilBoardBit , OnPulse , OnPol );           // Pulse On          
//          Serial.println("On Pulse " + String(OnPulse));
//          OnPol = LOW ;
//          OffPol = HIGH ;
          ActivateOutput((( evalve[i].OnCoilBoardBit & 0xf0 ) >>4 ) , (evalve[i].OnCoilBoardBit & 0x0f ) , OnPol , OnPulse ) ;
          delay(ghks.lPulseTime % 128 ); 
        }        
      }
      if ((vvalve[i].lTTG <= 0 )&&(vvalve[i].lATTG <= 0 )&&(vvalve[i].bOnOff)){
        vvalve[i].bOnOff = false ;
        board = ( evalve[i].OffCoilBoardBit & 0xf0 ) >> 4 ; 
        board = 0 ;
        if ( evalve[i].OffCoilBoardBit == evalve[i].OnCoilBoardBit ) {
//          IOEXP[board].write( evalve[i].OffCoilBoardBit , !OnPol );                      // hold off
          ActivateOutput((( evalve[i].OffCoilBoardBit & 0xf0 ) >>4 ) , (evalve[i].OffCoilBoardBit & 0x0f ) , !OnPol , 0 ) ;  // was offpol but not usefull
        }else{
//          IOEXP[board].pulsepin( evalve[i].OffCoilBoardBit , OffPulse , OffPol );        // Pulse Off 
//          Serial.println("Off Pulse " + String(OffPulse));
//          OnPol = LOW ;
//          OffPol = HIGH ;
          ActivateOutput((( evalve[i].OffCoilBoardBit & 0xf0 ) >>4 ) , (evalve[i].OffCoilBoardBit & 0x0f ) , OnPol , OffPulse ) ;
          delay(ghks.lPulseTime % 128 ); 
        }
      }
      if ( vvalve[i].bNetOnOff != vvalve[i].bOnOff ){
        vvalve[i].bNetOnOff = vvalve[i].bOnOff ;
//        if ( ( evalve[i].Node != 0 )){  // not sure if we should have this check
          bSendCtrlPacket = true ;        
//        }
      }
    }

    if (( ghks.SolContPower & 0x8000 ) != 0 ) {
      OnPol = ((ghks.SolContPower & 0x4000  ) >> 14  ) ;
      if ( bValveActiveAny ) {
        ActivateOutput((( ghks.SolContPower & 0xf0 ) >> 4 ) , (ghks.SolContPower & 0x0f ) , OnPol , 0 ) ;
      }else{
        ActivateOutput((( ghks.SolContPower & 0xf0 ) >> 4 ) , (ghks.SolContPower & 0x0f ) , !OnPol , 0 ) ;      
      }
    }
    if (( ghks.SolMastPower & 0x8000 ) != 0 ) {
      OnPol = ((ghks.SolMastPower & 0x4000  ) >> 14  ) ;
      if ( bValveActive ) {
        ActivateOutput((( ghks.SolMastPower & 0xf0 ) >> 4 ) , (ghks.SolMastPower & 0x0f ) , OnPol , 0 ) ;
      }else{
        ActivateOutput((( ghks.SolMastPower & 0xf0 ) >> 4 ) , (ghks.SolMastPower & 0x0f ) , !OnPol , 0 ) ;      
      }
    }
    
    loopStatusLEDSecond();

    rtc_sec = timeinfo.tm_sec ;
    lScanLast = lScanCtr ;
    lScanCtr = 0 ;
    MyIP = WiFi.localIP() ;                          // get this even if it fails as it says something about what happened
    MyIPC = WiFi.softAPIP() ;

//    if (ghks.lProgMethod == 0 ){
//      UpdateATTG() ;                                          // update the program switching Time To Go timers
//    }else{
//      UpdateATTGNew() ;                                       // update the program switching Time To Go timers      
//    }
    if (( evalve[i].TypeMaster & 0x100 ) != 0 ){            // wee patch if this is a fert bar valve on then the line is clear of fertiliser
      if ( evalve[i].bEnable && !bDirty2 && ( vvalve[i].lATTG == 0 )){   // this is active
        vvalve[i].lATTG = 2 ;
      }
    }     
    fertigation_min();
    fertigation_sec();

    DoADC_sec() ;

  } else{                        // end of the once per second stuff
    if ( bSendTestEmail ){
      SendEmailToClient(-1) ;
      bSendTestEmail = false ;
    }    
    if ( bSendSaveConfirm ) {
      if (WiFi.isConnected()){
        if (SMTP.bUseEmail && SMTP.bSpare ){   // using email and confirming changes
          SendEmailToClient(-4);               // email save confimation to eeprom
        }
        bSendSaveConfirm = false ;
      }
    }    
  }                         // end of the once per second stuff

