Dougal121/Essence_of_Thor/ESP32Now/ESP32_I2ClIrrigationValve_Core3.ino
  if (rtc_hour != timeinfo.tm_hour){
    if (( bSentADCAlarmEmail ) && ( timeinfo.tm_hour == 0 )){  // reset the email alarm if still asserted
      bSentADCAlarmEmail = false ;
      for ( i = 0 ; i < ADC_MAX_ALARM ; i++ ) {
        ADC_Trigger[i] = 0 ; 
      }
    }
    
    bSendCtrlPacket = true ;
    if ( !bConfig ) { // ie we have a network
//      sendNTPpacket(ghks.timeServer); // send an NTP packet to a time server  once and hour
    }else{
      if ( hasRTC ){
        DS3231_get(&tc);
        struct tm timeinfo = {};
        timeinfo.tm_year = tc.year - 1900;
        timeinfo.tm_mon  = tc.mon - 1;
        timeinfo.tm_mday = tc.mday;
        timeinfo.tm_hour = tc.hour;
        timeinfo.tm_min  = tc.min;
        timeinfo.tm_sec  = tc.sec;

        time_t t = mktime(&timeinfo);
        struct timeval tv = { .tv_sec = t, .tv_usec = 0 };
        settimeofday(&tv, nullptr);            
//        setTime((int)tc.hour,(int)tc.min,(int)tc.sec,(int)tc.mday,(int)tc.mon,(int)tc.year ) ; // set the internal RTC
      }
    }
    rtc_hour = timeinfo.tm_hour;
  }
  if ( rtc_min != timeinfo.tm_min){
    bSendCtrlPacket = true ;    
    lMinUpTime++ ;
    if ((  iDisplayCountDown > 0  )&& ( ghks.displaytimer>0)){  //  decrement display saver
       iDisplayCountDown-- ;
       if ((iDisplayCountDown == 0) ) {  //&& ( lMinUpTime > 5 )
//         Serial.print("A-"); 
//         StopWiFi();
       }
    }
       
    if (( lMinUpTime == 15 ) && SMTP.bUseEmail ) {
      SendEmailToClient(-2);                         // email that reboot just occureed  
    }
    
    iAutoResetStatus = 0 ;
    if (  ghks.SelfReBoot > 0 ) {
      iAutoResetStatus = 1 ;
      if ( lMinUpTime > MIN_REBOOT ) {
        iAutoResetStatus = 2 ;
        if ( lMinUpTime == ghks.SelfReBoot  ) {
          iAutoResetStatus = 3 ;
          if ( SMTP.bUseEmail ){
            SendEmailToClient(-3);                           // email intention to reboot on minute before you pull the pin
          }
        }
        if ( lMinUpTime > ghks.SelfReBoot ) {
          IndicateReboot() ;
        }
      }
    }
    NowTime = now() + 60 ;
    i = ( hour(NowTime) * 100 ) + minute(NowTime) ;
    iHM = ( hour() * 100 ) + minute() ;
    iRebootTime = ghks.lRebootTimeDay & 0xfff ;
    iDOW = dayOfWeek(now()) ;
    if (( ghks.lRebootTimeDay & 0x80000 ) != 0 ) {   // enabled and the right day
      iAutoResetStatus = -1 ;
      if (( ghks.lRebootTimeDay & ( 0x1000 << ( iDOW - 1))) != 0 )   {
        iAutoResetStatus = -2 ;
        if ( lMinUpTime > MIN_REBOOT ) { 
          if (iRebootTime == 0 ){
            if ( iHM == 2359 ) {
              iAutoResetStatus = 3 ;
              if (SMTP.bUseEmail){
                SendEmailToClient(-3);                         // email intention to reboot on minute before you pull the pin
              }
            }         
          }else{
            if (i == iRebootTime ){
              iAutoResetStatus = -3 ;
              if (SMTP.bUseEmail){
                SendEmailToClient(-3);                         // email intention to reboot on minute before you pull the pin
              }
            }          
          }
          if (iRebootTime == iHM ){
            IndicateReboot() ;
          }
        }
      }
    }
    if (iValveLogTTG>0){
      iValveLogTTG -- ;
    }
    if ( lMinBusScan > 0 ) {
      lMinBusScan -- ;
    }
    if (lMinBusScan == 0 ) {
      if (SMTP.iBusScanInterval>0) {
        iBusReturn = i2cBusCheck();
        if (( iBusReturn != 0 ) && bBusGood ){
          if ( SMTP.bUseEmail ) {
            SendEmailToClient(666); 
          }
          bBusGood = false ;
        }
        if ( SMTP.iBusScanInterval < MINBUSSCANINTERVAL ){
          lMinBusScan = MINBUSSCANINTERVAL ;          
        }else{
          lMinBusScan = SMTP.iBusScanInterval ;          
        }
      }
    }

    if ((ghks.ValveLogOptions & 0x80 )!=0 ){
      UpDateValveLogs();
    }
    if ((ghks.ValveLogOptions & 0x40 )!=0 ){
      bDoFertUpload = true ;
    }
    
    for (i = 0 ; i < MAX_VALVE ; i++ ) {
      if ( vvalve[i].lATTG > 0 ){
        vvalve[i].lATTG -- ;
      }else{
        if ( vvalve[i].lTTG > 0 ){
          vvalve[i].lTTG -- ;
        }
      }
    }  

    if ( hasRTC ){
      rtc_temp = DS3231_get_treg(); 
    }
    rtc_min = timeinfo.tm_min ;
    fertigation_min();
  }
  if ((timeinfo.tm_min == 0) && (timeinfo.tm_hour != rtc_fert_hour)){
    SaveCurrentQty(true);
    rtc_fert_hour = timeinfo.tm_hour ;
//    Serial.println("Fert Save");
  }

  if ((iValveLogTTG==0)){
    if ((ghks.ValveLogOptions & 0x80) != 0 ){ // can switch this off
      bBusy = false ;
      for ( i = 0 ; i < MAX_FERT ; i++){  // dont do this if we timing pumps
        if (vfert[i].bOnOff){
          bBusy = true ;
        }
      }  
      if (!bBusy){
        WriteValveLogsToEEPROM() ;
        iValveLogTTG = (int)(ghks.ValveLogOptions & 0x3f) * 10 + 20 ; // minutes to the next save
      }
    }
  }
  lRet = ctrludp.parsePacket() ;
  if ( lRet != 0 ) {
    processCtrlUDPpacket(lRet);
  }

  if (bSendCtrlPacket){
    sendCTRLpacket() ;
    bSendCtrlPacket = false ;
  }
  if (lTimePrev > ( lTime + 100000 )){ // Housekeeping --- has wrapped around so back to zero
    lTimePrev = lTime ; // skip a bit 
//    Serial.println("Wrap around");
  }
  
  filter_scan();
  filter_sec();

  rf.loop();
  mesh.loop();
  modbus.loop();  


}   //  ################### BOTTOM OF LOOP ########################


void SetSelectedSpeed(void){
  switch(ghks.cpufreq){
    case 13:
      setCpuFrequencyMhz(13);
    break;
    case 26:
      setCpuFrequencyMhz(26);
    break;
    case 80:
      setCpuFrequencyMhz(80);
    break;
    case 160:
      setCpuFrequencyMhz(160);
    break;
    default:
      setCpuFrequencyMhz(240);
    break;    
  }
//  Serial.println("CPU commanded " +String(ghks.cpufreq) + " actual " + String(getCpuFrequencyMhz())+ " MHz");
//  Serial.println("CPU commanded " +String(ghks.cpufreq)+ " MHz");
}

time_t previousSunday(time_t t)
{
  struct tm tm;
  localtime_r(&t, &tm);

  int wday = tm.tm_wday;   // 0 = Sunday
  return t - (wday * 86400);
}
time_t firstDayOfYear(time_t t)
{
  struct tm tm;
  localtime_r(&t, &tm);

  tm.tm_mon  = 0;
  tm.tm_mday = 1;
  tm.tm_hour = 0;
  tm.tm_min  = 0;
  tm.tm_sec  = 0;

  return mktime(&tm);
}



