Dougal121/Essence_of_Thor/ESP32Now/ESP32_I2ClIrrigationValve_Core3.ino
bool isTimeValid() {
  time_t now;
  time(&now);
  return now > 100000;  // crude but effective (i.e., not Jan 1 1970)
}

int second() {
  time_t now;
  time(&now);
  return localtime(&now)->tm_sec;
}

int minute() {
  time_t now;
  time(&now);
  return localtime(&now)->tm_min;
}

int hour() {
  time_t now;
  time(&now);
  return localtime(&now)->tm_hour;
}

int day() {
  time_t now;
  time(&now);
  return localtime(&now)->tm_mday;
}

int month() {
  time_t now;
  time(&now);
  return localtime(&now)->tm_mon + 1;
}

int year() {
  time_t now;
  time(&now);
  return localtime(&now)->tm_year + 1900;
}

// Returns the current time as a time_t
time_t now() {
  time_t currentTime;
  time(&currentTime);
  return currentTime;
}


void setTime(int hr, int mn, int sc, int dy, int mon, int yr) {
  struct tm t = {};
  t.tm_hour = hr;
  t.tm_min = mn;
  t.tm_sec = sc;
  t.tm_mday = dy;
  t.tm_mon = mon - 1;
  t.tm_year = yr - 1900;

  time_t now = mktime(&t);
  struct timeval tv = { .tv_sec = now };
  settimeofday(&tv, nullptr);
}

void setTime(time_t t) {
  struct timeval tv = { .tv_sec = t };
  settimeofday(&tv, nullptr);
}

int hour(time_t t) {
  struct tm timeinfo = *localtime(&t);
//  struct tm *timeinfo = localtime(&t);
//  return timeinfo->tm_hour;
  return timeinfo.tm_hour;
}

int minute(time_t t) {
  struct tm timeinfo = *localtime(&t);
//  struct tm *timeinfo = localtime(&t);
  return timeinfo.tm_min;
}

int second(time_t t) {
  struct tm timeinfo = *localtime(&t);
//  struct tm *timeinfo = localtime(&t);
  return timeinfo.tm_sec;
}

int day(time_t t) {
  struct tm timeinfo = *localtime(&t);
//  struct tm *timeinfo = localtime(&t);
  return timeinfo.tm_mday;
}

int month(time_t t) {
  struct tm timeinfo = *localtime(&t);
//  struct tm *timeinfo = localtime(&t);
  return timeinfo.tm_mon + 1;
}

int year(time_t t) {
  struct tm timeinfo = *localtime(&t);
//  struct tm *timeinfo = localtime(&t);
  return timeinfo.tm_year + 1900;
}

int dayOfWeek() {
  struct tm timeinfo;
  if (getLocalTime(&timeinfo)) {
    return timeinfo.tm_wday == 0 ? 1 : timeinfo.tm_wday + 1;  // Map 0–6 to 1–7
  }
  return -1;  // Error
}

int dayOfWeek(time_t t) {
  struct tm timeinfo = *localtime(&t);
//  struct tm *timeinfo = localtime(&t);
  // tm_wday: 0 (Sunday) .. 6 (Saturday)
  // TimeLib: 1 (Sunday) .. 7 (Saturday)
  return (timeinfo.tm_wday == 0) ? 1 : timeinfo.tm_wday + 1;
}
int weekday(time_t t){
  struct tm timeinfo = *localtime(&t);
  int wday = timeinfo.tm_wday+1;   // 0 = Sunday … 6 = Saturday
  return(wday);
}

time_t previousMidnight() {
  return previousMidnight(now());
}

time_t previousMidnight(time_t t) {
  struct tm timeinfo = *localtime(&t);
//  struct tm *timeinfo = localtime(&t);
  timeinfo.tm_hour = 0;
  timeinfo.tm_min  = 0;
  timeinfo.tm_sec  = 0;
  return mktime(&timeinfo);
}

time_t makeTime(const tmElements_t &tm) {
    struct tm t;
    t.tm_sec  = tm.Second;
    t.tm_min  = tm.Minute;
    t.tm_hour = tm.Hour;
    t.tm_mday = tm.Day;
    t.tm_mon  = tm.Month - 1;
    t.tm_year = tm.Year + 1970 - 1900;
    t.tm_isdst = -1;  // Let system determine DST

    return mktime(&t);
}

void breakTime(time_t t, tmElements_t &tm) {
    struct tm timeinfo = *localtime(&t);
//  struct tm *timeinfo = localtime(&t);

    tm.Second = timeinfo.tm_sec;
    tm.Minute = timeinfo.tm_min;
    tm.Hour   = timeinfo.tm_hour;
    tm.Day    = timeinfo.tm_mday;
    tm.Month  = timeinfo.tm_mon + 1;
    tm.Year   = timeinfo.tm_year + 1900 - 1970;
    tm.Wday   = timeinfo.tm_wday + 1;  // TimeLib uses 1-7, Sunday = 1
}
